"use strict";

window.StrategyDescriptions = Object.freeze({
  s1: "14:53按Score2全市场前0.8%（向下取整）与中证1000取交集后买入，当日可用资金均分买入（初始资金50万）；次日+9%限价止盈，10:00强制卖出",
  s2: "14:53按Score2全市场前1.17%（向下取整）与中证1000取交集后买入，当日可用资金均分买入（初始资金50万）；次日+9%限价止盈，10:00强制卖出",
  s3: "14:53按Score2全市场前1.08%（向下取整）与中证1000取交集后买入，当日可用资金均分买入（初始资金50万）；次日+9%限价止盈，10:00强制卖出",
  s4: "14:53按Score2全市场前0.5%（向下取整）买入，每笔固定买入10万元（初始资金20万）；+9%止盈，否则第3个后续交易日14:55卖出",
  s5: "14:53按Score2全市场前0.8%（向下取整）买入，每笔固定买入10万元（初始资金50万）；+9%止盈，否则第3个后续交易日14:55卖出",
  s6: "14:53按Score2全市场前0.5%（向下取整）买入，每笔固定买入10万元（初始资金20万）；+9%止盈，否则第5个后续交易日14:55卖出",
  s7: "14:53按Score2全市场前0.4%（向下取整）买入，每笔固定买入10万元（初始资金20万）；+9%止盈，否则第5个后续交易日14:55卖出",
  s8: "14:53按Score2全市场前0.8%（向下取整）买入，每笔固定买入10万元（初始资金50万）；+12%止盈，否则第3个后续交易日14:55卖出",
  s9: "14:53按Score2全市场前0.8%（向下取整）买入，每笔固定买入10万元（初始资金50万）；+12%止盈，否则第5个后续交易日14:55卖出",
  s10: "14:53按Score2全市场前0.8%（向下取整）买入，每笔固定买入10万元（初始资金100万）；+12%止盈，否则第3个后续交易日14:55卖出",
  s11: "14:53按Score2全市场前0.8%（向下取整）买入，每笔固定买入10万元（初始资金100万）；+12%止盈，否则第5个后续交易日14:55卖出",
  s12: "14:53按Score2全市场前0.8%（向下取整）买入，每笔固定买入10万元（初始资金100万）；+9%止盈，否则第3个后续交易日14:55卖出",
  s13: "14:53按Score2全市场前0.8%（向下取整）买入，每笔固定买入10万元（初始资金100万）；+9%止盈，否则第5个后续交易日14:55卖出"
});
